### **Ejercicio 1: Limpiar y transformar columnas de texto**
Dado el siguiente DataFrame de productos:

In [104]:
import pandas as pd

data = {
    'Producto': ['Café', 'té', ' chocolate', ' Cacao '],
    'Precio': [100, 80, 150, 120],
    'Categoría': ['bebidas calientes', 'bebidas calientes', 'snacks dulces', ' bebidas calientes ']
}

df_productos = pd.DataFrame(data)

In [67]:
print(df_productos)

     Producto  Precio            Categoría
0        Café     100    bebidas calientes
1          té      80    bebidas calientes
2   chocolate     150        snacks dulces
3      Cacao      120   bebidas calientes

1. Elimina los espacios en blanco de las columnas **Producto**.
2. Convierte todos los valores de la columna **Categoría** a mayúsculas.
3. Reemplaza la categoría 'snacks dulces' por 'postres'.
4. Crea una nueva columna que indique si el precio es mayor o igual a 120. Usa una función `lambda` para esto.

In [68]:
df_productos["Prod_1"]= df_productos["Producto"].str.strip()
print(df_productos)

     Producto  Precio            Categoría     Prod_1
0        Café     100    bebidas calientes       Café
1          té      80    bebidas calientes         té
2   chocolate     150        snacks dulces  chocolate
3      Cacao      120   bebidas calientes       Cacao

In [69]:
df_productos['Categoría'] = df_productos["Categoría"].str.upper()
print(df_productos)

     Producto  Precio            Categoría     Prod_1
0        Café     100    BEBIDAS CALIENTES       Café
1          té      80    BEBIDAS CALIENTES         té
2   chocolate     150        SNACKS DULCES  chocolate
3      Cacao      120   BEBIDAS CALIENTES       Cacao

In [70]:
df_productos['Categoría']= df_productos['Categoría'].replace('SNACKS DULCES', 'POSTRES')
print(df_productos)

     Producto  Precio            Categoría     Prod_1
0        Café     100    BEBIDAS CALIENTES       Café
1          té      80    BEBIDAS CALIENTES         té
2   chocolate     150              POSTRES  chocolate
3      Cacao      120   BEBIDAS CALIENTES       Cacao

In [71]:
df_productos['Precio >=120l'] = df_productos['Precio'].apply(lambda x: x >= 120)
df_productos

     Producto  Precio            Categoría     Prod_1  Precio >=120l
0        Café     100    BEBIDAS CALIENTES       Café          False
1          té      80    BEBIDAS CALIENTES         té          False
2   chocolate     150              POSTRES  chocolate           True
3      Cacao      120   BEBIDAS CALIENTES       Cacao           True

### **Ejercicio 2: Limpieza de duplicados y manejo de datos faltantes**
Dado el siguiente DataFrame de empleados:

In [109]:
data_empleados = {
    'Nombre': ['Ana', 'Luis', 'Pedro', 'Luis', 'Juan', 'Ana'],
    'Edad': [29, 45, None, 40, 35, 29],
    'Departamento': ['Ventas', 'Finanzas', 'RRHH', 'Finanzas', 'Marketing', None]
}

df_empleados = pd.DataFrame(data_empleados)

In [108]:
print(df_empleados)

0       Ventas
1     Finanzas
2         RRHH
3     Finanzas
4    Marketing
5    Marketing
Name: Departamento, dtype: object

1. Elimina las filas duplicadas en base a la columna **Nombre**. Quédate con la persona `más joven´.
2. Llena los valores faltantes de la columna **Edad** con la media de las edades.
3. Llena los valores faltantes de la columna **Departamento** con el valor 'Desconocido'.
4. Ordena el DataFrame por edad de forma descendente.

In [94]:
df_empleados = df_empleados.sort_values(by=['Nombre', 'Edad'])
df_empleados = df_empleados.drop_duplicates(subset='Nombre', keep='first')
df_empleados

  Nombre  Edad Departamento
0    Ana  29.0       Ventas
4   Juan  35.0    Marketing
3   Luis  40.0     Finanzas
2  Pedro   NaN         RRHH

In [97]:
Edad_media = df_empleados['Edad'].mean()
df_empleados['Edad'] = df_empleados['Edad'].fillna(Edad_media)
df_empleados

  Nombre       Edad Departamento
0    Ana  29.000000       Ventas
4   Juan  35.000000    Marketing
3   Luis  40.000000     Finanzas
2  Pedro  34.666667         RRHH

In [111]:
df_empleados['Departamento']= df_empleados['Departamento'].fillna('desconocido')
df_empleados

  Nombre  Edad Departamento
0    Ana  29.0       Ventas
1   Luis  45.0     Finanzas
2  Pedro   NaN         RRHH
3   Luis  40.0     Finanzas
4   Juan  35.0    Marketing
5    Ana  29.0  desconocido

In [113]:
df_empleados = df_empleados.sort_values(by='Edad', ascending=False)
print(df_empleados)

  Nombre  Edad Departamento
1   Luis  45.0     Finanzas
3   Luis  40.0     Finanzas
4   Juan  35.0    Marketing
0    Ana  29.0       Ventas
5    Ana  29.0  desconocido
2  Pedro   NaN         RRHH

### **Ejercicio 3: Aplicar funciones a las columnas**
Dado un DataFrame de ventas de productos:

In [115]:
data_ventas = {
    'Producto': ['Café', 'Té', 'Jugo', 'Agua'],
    'Precio': [120, 80, 90, 60],
    'Cantidad': [3, 5, 2, 8]
}

df_ventas = pd.DataFrame(data_ventas)

In [117]:
print(df_ventas)

  Producto  Precio  Cantidad
0     Café     120         3
1       Té      80         5
2     Jugo      90         2
3     Agua      60         8

1. Calcula el total de ventas (Precio * Cantidad) y agrégalo como una nueva columna.
2. Crea una nueva columna llamada **Descuento** que aplique un descuento del 10% si el precio es mayor a 100, y del 5% si es menor o igual a 100. Usa la función `apply` y una función `lambda`.

In [122]:
df_ventas['Tot_ventasxprod'] = df_ventas["Precio"] *df_ventas["Cantidad"]
df_ventas

  Producto  Precio  Cantidad  Tot_ventasxprod
0     Café     120         3              360
1       Té      80         5              400
2     Jugo      90         2              180
3     Agua      60         8              480

In [126]:
df_ventas['Descuento']= df_ventas['Precio'].apply(lambda x: 0.10 if x> 100 else 0.05)
print(df_ventas)

  Producto  Precio  Cantidad  Tot_ventasxprod  Descuento
0     Café     120         3              360       0.10
1       Té      80         5              400       0.05
2     Jugo      90         2              180       0.05
3     Agua      60         8              480       0.05

### **Ejercicio 4: Uso de funciones de cadena**
Dado el siguiente DataFrame de direcciones de clientes:

In [127]:
data_clientes = {
    'Cliente': ['Juan Pérez', 'Ana Ruiz', 'Pedro López'],
    'Dirección': ['calle falsa 123', 'Calle PRINCIPAL 45', 'AV. LOS robles 34']
}

df_clientes = pd.DataFrame(data_clientes)

In [128]:
df_clientes

       Cliente           Dirección
0   Juan Pérez     calle falsa 123
1     Ana Ruiz  Calle PRINCIPAL 45
2  Pedro López   AV. LOS robles 34

1. Convierte todos los valores de la columna **Dirección** a minúsculas.
2. Reemplaza las abreviaturas "calle", "av." por "calle" y "avenida" respectivamente.
3. Extrae el número de la dirección y guárdalo en una nueva columna llamada **Número**.

In [129]:
df_clientes['Dirección'] = df_clientes['Dirección'].str.lower()
print(df_clientes)

       Cliente           Dirección
0   Juan Pérez     calle falsa 123
1     Ana Ruiz  calle principal 45
2  Pedro López   av. los robles 34

In [138]:
Dire_corregido = {'calle': 'Calle', 'av.' : 'Avenida'}
df_clientes['Dirección'] = df_clientes['Dirección'].replace(Dire_corregido, regex=True)
df_clientes

       Cliente              Dirección
0   Juan Pérez        Calle falsa 123
1     Ana Ruiz     Calle principal 45
2  Pedro López  Avenida los robles 34

In [140]:
df_clientes['Número'] = df_clientes['Dirección'].str.extract(r'(\d+)')
print(df_clientes)

       Cliente              Dirección Número
0   Juan Pérez        Calle falsa 123    123
1     Ana Ruiz     Calle principal 45     45
2  Pedro López  Avenida los robles 34     34